---
kind: type
id: T:Autodesk.Revit.DB.LayerCategoryType
source: html/7fc41293-ee24-a6cd-dc71-a5f9941cd0da.htm
---
# Autodesk.Revit.DB.LayerCategoryType

An enumerated type listing category types supported in an ExportLayerTable.

## Syntax (C#)
```csharp
public enum LayerCategoryType
```